app/controllers/admin_controller.rb

INSERT INTO "products" ("name", "price", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Shoes"], ["price", 2000.0], ["quantity", 3], ["created_at", "2016-12-12 06:35:01.694164"], ["updated_at", "2016-12-12 06:35:01.694164"]]
---
  def add_products
    begin
      product = Product.new(params.permit(:name,:price,:quantity))
    if product.save!