app/controllers/users_controller.rb

   def signup
   begin
    user = User.new(user_params)
    if user.save!
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def login
   begin
   user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'krishna@qburst.com' LIMIT 1

   def delete_from_cart
     begin
       response = CartService.new(params).delete_item(current_user)
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 3]]

   def add_user_profile_pic
     begin
       pro = ProfilePicture.new(params.permit(:user_id,:photo))
       # image                        = Paperclip.io_adapters.for(params[:photo])
       # pro.photo = image
       pro.user_id = 1
       pro.save
---
INSERT INTO "profile_pictures" ("user_id", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["photo_file_name", "Maryland_original.jpg"], ["photo_content_type", "image/jpeg"], ["photo_file_size", 159571], ["photo_updated_at", "2016-12-16 11:54:44.547038"]]